In [1]:
import numpy as np
import pandas as pd

In [2]:
peliculas = pd.DataFrame(
            {'Año': [2014, 2014, 2013, 2013, 2001],
             'Valoración': [6, None, 8.75, None, 8.9],
             'Presupuesto': [160, 250, 100, None, 93],
             'Director': ['Gareth Edwards', 'Peter Jackson', 'Martin Scorsese', 'Alfonso Cuarón', 'Peter Jackson'],
             'Título': ['Godzilla', 'El Hobbit III', 'El lobo del Wall Street', 'Gravity', 'Lord of the Rings']})
peliculas

    Año  Valoración  Presupuesto         Director                   Título
0  2014        6.00        160.0   Gareth Edwards                 Godzilla
1  2014         NaN        250.0    Peter Jackson            El Hobbit III
2  2013        8.75        100.0  Martin Scorsese  El lobo del Wall Street
3  2013         NaN          NaN   Alfonso Cuarón                  Gravity
4  2001        8.90         93.0    Peter Jackson        Lord of the Rings

In [3]:
# Filas: Año, Columnas: Director, Valores: Título
peliculas.pivot(index = 'Año', columns = 'Director', values = 'Título')

Director,Alfonso Cuarón,Gareth Edwards,Martin Scorsese,Peter Jackson
Año,,,,
2001,NaN,NaN,NaN,Lord of the Rings
2013,Gravity,NaN,El lobo del Wall Street,NaN
2014,NaN,Godzilla,NaN,El Hobbit III

In [4]:
# Establecemos el índice a las dos variables sobre las que queremos 'pivotar'
p = peliculas.set_index(['Año', 'Director'])
p

                      Valoración  Presupuesto                   Título
Año  Director
2014 Gareth Edwards         6.00        160.0                 Godzilla
     Peter Jackson           NaN        250.0            El Hobbit III
2013 Martin Scorsese        8.75        100.0  El lobo del Wall Street
     Alfonso Cuarón          NaN          NaN                  Gravity
2001 Peter Jackson          8.90         93.0        Lord of the Rings

In [5]:
# Pasamos el último nivel de índice de filas a columnas
p = p.unstack()
p

             Valoración                                               \
Director Alfonso Cuarón Gareth Edwards Martin Scorsese Peter Jackson
Año
2001                NaN            NaN             NaN           8.9
2013                NaN            NaN            8.75           NaN
2014                NaN            6.0             NaN           NaN

            Presupuesto                                               \
Director Alfonso Cuarón Gareth Edwards Martin Scorsese Peter Jackson
Año
2001                NaN            NaN             NaN          93.0
2013                NaN            NaN           100.0           NaN
2014                NaN          160.0             NaN         250.0

                 Título                                          \
Director Alfonso Cuarón Gareth Edwards          Martin Scorsese
Año
2001                NaN            NaN                      NaN
2013            Gravity            NaN  El lobo del Wall Street
2014                NaN       Godzilla                      NaN


Director      Peter Jackson
Año
2001      Lord of the Rings
2013                    NaN
2014          El Hobbit III

In [6]:
# Elegimos únimaente el valor de la columnas Título
p['Título']

Director,Alfonso Cuarón,Gareth Edwards,Martin Scorsese,Peter Jackson
Año,,,,
2001,NaN,NaN,NaN,Lord of the Rings
2013,Gravity,NaN,El lobo del Wall Street,NaN
2014,NaN,Godzilla,NaN,El Hobbit III

In [7]:
peliculas

    Año  Valoración  Presupuesto         Director                   Título
0  2014        6.00        160.0   Gareth Edwards                 Godzilla
1  2014         NaN        250.0    Peter Jackson            El Hobbit III
2  2013        8.75        100.0  Martin Scorsese  El lobo del Wall Street
3  2013         NaN          NaN   Alfonso Cuarón                  Gravity
4  2001        8.90         93.0    Peter Jackson        Lord of the Rings

In [8]:
# Hacemos que haya dos películas para el mismo año y director
peliculas.loc[peliculas['Año'] == 2001, 'Año'] = 2014
peliculas

    Año  Valoración  Presupuesto         Director                   Título
0  2014        6.00        160.0   Gareth Edwards                 Godzilla
1  2014         NaN        250.0    Peter Jackson            El Hobbit III
2  2013        8.75        100.0  Martin Scorsese  El lobo del Wall Street
3  2013         NaN          NaN   Alfonso Cuarón                  Gravity
4  2014        8.90         93.0    Peter Jackson        Lord of the Rings

In [9]:
#Utilizamos la función pivot_table para establecer: valor, índice, columnas y función de agregación en caso de colisión
peliculas.pivot_table(values = 'Presupuesto', index= ['Director'], columns = 'Año', aggfunc = np.sum)

C:\Users\ASUS\AppData\Local\Temp\ipykernel_21752\753924434.py:2: FutureWarning: The provided callable <function sum at 0x000002082F243F60> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  peliculas.pivot_table(values = 'Presupuesto', index= ['Director'], columns = 'Año', aggfunc = np.sum)

Año               2013   2014
Director
Alfonso Cuarón     0.0    NaN
Gareth Edwards     NaN  160.0
Martin Scorsese  100.0    NaN
Peter Jackson      NaN  343.0

In [10]:
serie = pd.Series([1,2,3,4], index = ['a','b','c','d'])
serie

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
dataframe = pd.DataFrame(np.arange(16).reshape(4,4), index = ['f1','f2','f3','f4'], columns = ['c1','c2','c3','c4'])
dataframe

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [12]:
# Eliminación de valores de una Serie
serie.drop('a')

b    2
c    3
d    4
dtype: int64

In [13]:
del serie['b']
serie

a    1
c    3
d    4
dtype: int64

In [14]:
# Eliminación de filas de un DataFrame
dataframe.drop('f1')

    c1  c2  c3  c4
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [15]:
del dataframe['c2']
dataframe

    c1  c3  c4
f1   0   2   3
f2   4   6   7
f3   8  10  11
f4  12  14  15

In [16]:
# Eliminación de columnas de un DataFrame
dataframe.drop('c3', axis=1)

    c1  c4
f1   0   3
f2   4   7
f3   8  11
f4  12  15

In [17]:
serie1 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
serie1

a    1
b    2
c    3
d    4
dtype: int64

In [18]:
serie2 = pd.Series([5, 6, 7, 8], index=['c', 'd', 'e', 'f'])
serie2

c    5
d    6
e    7
f    8
dtype: int64

In [19]:
# Resultado de operaciones básicas
serie1 + serie2

a     NaN
b     NaN
c     8.0
d    10.0
e     NaN
f     NaN
dtype: float64

In [20]:
# Resultado con operación pandas
serie1.add(serie2)

a     NaN
b     NaN
c     8.0
d    10.0
e     NaN
f     NaN
dtype: float64

In [21]:
# Resultado con operación pandas y relleno
serie1.add(serie2, fill_value=0)

a     1.0
b     2.0
c     8.0
d    10.0
e     7.0
f     8.0
dtype: float64

In [22]:
serie1.sub(serie2, fill_value=0)

a    1.0
b    2.0
c   -2.0
d   -2.0
e   -7.0
f   -8.0
dtype: float64

In [23]:
serie1.mul(serie2, fill_value=1)

a     1.0
b     2.0
c    15.0
d    24.0
e     7.0
f     8.0
dtype: float64

In [24]:
serie1.div(serie2, fill_value=0)

a         inf
b         inf
c    0.600000
d    0.666667
e    0.000000
f    0.000000
dtype: float64

In [25]:
dataframe1 = pd.DataFrame(np.arange(16).reshape(4,4), index = ['f1','f2','f3','f4'], columns = ['c1','c2','c3','c4'])
dataframe1

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [26]:
dataframe2 = pd.DataFrame(np.arange(17, 33).reshape(4,4), index = ['f1','f2','f5','f6'], columns = ['c1','c2','c6','c7'])
dataframe2

    c1  c2  c6  c7
f1  17  18  19  20
f2  21  22  23  24
f5  25  26  27  28
f6  29  30  31  32

In [27]:
dataframe1.add(dataframe2, fill_value = 0)

      c1    c2    c3    c4    c6    c7
f1  17.0  19.0   2.0   3.0  19.0  20.0
f2  25.0  27.0   6.0   7.0  23.0  24.0
f3   8.0   9.0  10.0  11.0   NaN   NaN
f4  12.0  13.0  14.0  15.0   NaN   NaN
f5  25.0  26.0   NaN   NaN  27.0  28.0
f6  29.0  30.0   NaN   NaN  31.0  32.0

#### Ordenación en Series

In [28]:
serie = pd.Series([3, 2, 1, 4], index=['d','a', 'c', 'b'])
serie

d    3
a    2
c    1
b    4
dtype: int64

In [29]:
# Ordenación por índice
serie.sort_index()

a    2
b    4
c    1
d    3
dtype: int64

In [30]:
# Ordenación descendente por índice
serie.sort_index(ascending=False)

d    3
c    1
b    4
a    2
dtype: int64

In [31]:
# Ordenación valores
serie.sort_values(ascending=False)

b    4
d    3
a    2
c    1
dtype: int64

In [32]:
# Ordenación descendente por valores
serie.sort_values(ascending=False)

b    4
d    3
a    2
c    1
dtype: int64

In [33]:
serie = pd.Series(np.arange(100))
serie

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Length: 100, dtype: int64

In [34]:
dataframe = pd.DataFrame(np.arange(100).reshape(10,10))
dataframe

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [35]:
# Recuperación de los 5 primero elementos de una Serie
serie.head(3)

0    0
1    1
2    2
dtype: int64

In [36]:
# Recuperación de los 5 últimos elementos de una Serie
serie.tail(7)

93    93
94    94
95    95
96    96
97    97
98    98
99    99
dtype: int64

In [37]:
# Recuperación de los 5 primero elementos de una DataFrame
dataframe.head(2)

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19

In [38]:
# Recuperación de los 5 últimos elementos de una DataFrame
dataframe.tail(3)

    0   1   2   3   4   5   6   7   8   9
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99